Config/Reports/БезвозмездныеПоступленияПередачиМЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>БезвозмездныеПоступленияПередачиМЗ</Name>
		</Properties>
	</Report>
</MetaDataObject>

Config/Enums/ВидыДвиженийНФА.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДвиженийНФА</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПереоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеРеорганизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приобретение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриобретениеЦС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеВнутриведомственное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОдногоУровняБюджета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеМежбюджетное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеБезвозмездноеИное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеИзлишков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеСменаКурсаВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличениеПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаНуждыУчреждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеВнутриведомственное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеОдногоУровняБюджета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеМежбюджетное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБезвозмездноеИное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНедостачИХищений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЧС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеПорчи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшениеПрочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Reports/БезвозмездныеПоступленияПередачиМЗ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	// Программное выполнение отчета
	СтандартнаяОбработка = Ложь;
	
	ИсполняемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ИсполняемыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыДвиженийНФАБезвозмезднойПередачи", ВидыДвиженийНФАБезвозмезднойПередачи());
	ИсполняемыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидыДвиженийНФАБезвозмедногоПоступления", ВидыДвиженийНФАБезвозмедногоПоступления());
	ИсполняемыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("КЭКБезвозмездногоПоступления", КЭКБезвозмездногоПоступления());
	ИсполняемыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("КЭКБезвозмезднойПередачи", КЭКБезвозмезднойПередачи());
	
	//ИсполняемыеНастройки = Настройки.ПолучитьНастройки();
	ВнешниеНаборыДанных = Неопределено;
	ВозможностьИспользованияВнешнихФункций = Истина;
	
	КомпоновщикМакетаКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКомпоновкиДанных, ИсполняемыеНастройки, ДанныеРасшифровки);
	
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных, ДанныеРасшифровки,
		ВозможностьИспользованияВнешнихФункций);
		
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКД, Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КЭКБезвозмезднойПередачи()
	Возврат БухгалтерскийУчет.СписокКЭК("240,250,280");
КонецФункции

Функция КЭКБезвозмездногоПоступления()
	Возврат БухгалтерскийУчет.СписокКЭК("190");
КонецФункции

Функция ВидыДвиженийНФАБезвозмедногоПоступления()
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.ПоступлениеБезвозмездноеИное);
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.ПоступлениеВнутриведомственное);
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.ПоступлениеМежбюджетное);
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.ПоступлениеОдногоУровняБюджета);
	Возврат Результат;
КонецФункции

Функция ВидыДвиженийНФАБезвозмезднойПередачи()
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.СписаниеБезвозмездноеИное);
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.СписаниеВнутриведомственное);
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.СписаниеМежбюджетное);
	Результат.Добавить(Перечисления.ВидыДвиженийНФА.СписаниеОдногоУровняБюджета);
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
